<?php

$tasks_form = array(
'tasks_editor_title' => 'Редактор задач',
'button_add' => 'Добавить новую',
'button_modify' => 'Изменить выбранную',
'button_delete' => 'Удалить выбранную',
'button_params' => 'Параметры выбранной',
'title' => 'Редактор задач',
'note' => 'Необходимы все поля',
'button_ok' => 'Сохранить',
'button_cancel' => 'Отбой',
'app_name_caption' => 'Имя приложения',
'caption_caption' => 'Название задачи',
'par_number_caption' => 'Количество параметров',
'status_caption' => 'Статус задачи',
'popularity_caption' => 'Уровень популярности',
'complexity_caption' => 'Уровень сложности (0..2)',
'sequence_caption' => 'Порядок следования',
'description_en_caption' => 'Описание (англ.)',
'remark_en_caption' => 'Примечание (англ.)',
'description_ru_caption' => 'Описание (рус.)',
'remark_ru_caption' => 'Примечание (рус.)',
'del_caption' => 'Удалить задачу?',
'button_del' => 'Удалить выбранную задачу',
'button_cancel' => 'Передумал',
'no_sel_warning' => 'Ничего не выбрано',
'warn_date_fromat' => 'Формат даты: ГГГГ-ММ-ДД ЧЧ:ММ',
'warn_station' => 'По крайней мере 1 станция должна быть выбрана',
'del_warning' => 'Задача и все ее параметры и ассоциированные задания будут удалены без возможности восстановления. Вы уверены?',
'job_enqueued' => 'задача в очереди'
);

$jobs_new = array(
'jobs_new_title' => 'Новое задание',
'complexity' => 'Сложность',
'caption' => 'Название',
'description' => 'Описание',
'remark' => 'Примечание',
'complexity_at' => array('для новичков','для продвинутых','для экспертов'),
'caption_tt' => 'Указать параметры для задания и поставить в очередь на счет',
'description_tt' => 'Посмотреть методические указания по работе с этим типом задач',
'jobs_new_note' => 'Используйте Название, как ссылку для формирования параметров и запуск задания, а Описание - как ссылку на методичку.<br>Другой способ создания нового задания - "Задания->Редактирование->Добавить новое".'
);

$job_params_form = array(
'title' => 'Установить параметры задания',
'note' => 'Необходимы все поля. Тип: 0-числовой(int, float, bool), 1-символьный, 2-дата (ГГГГ-ММ-ДД ЧЧ:ММ). Можете менять "Ваше значение".',
'note_1' => 'Формат ввода даты: ГГГГ-ММ-ДД ЧЧ:ММ ',
'note_2' => 'минимальная: ',
'note_3' => 'Максимальное число разбиений гистограммы: ',
'caption' => 'Название параметра',
'name' => 'Обозначение',
'type' => 'Тип',
'def_val' =>'Ваше значение',
'min_val' =>'Значение Min',
'max_val' => 'Значение Max',
'dtitle_templ' => 'По шаблону ( ',
'dtitle_new' => 'Новое ( '
);

?>

