<?php
$tasks_descr_txt = array(
    'page_title'=>'Список задач выставленных пользователями и участниками проекта на общее обозрение',
    'note' =>'<p>Здесь представлены показательные задачи, выполненные, как администраторами сайта, так и обычными пользователями. Задачи содержат описание проделанной работы, выводы итд. Интернет-ссылка имеет открытый статус и доступна для просмотра любому желающему. Для того, чтобы ваша задача попала в этот список, вы должны правильно её оформить, описав суть проблемы, выводы и так далее. И отправить запрос  <a href="mailto:chelkov@jinr.ru?subject=моя задача"> руководителю проекта </a>. Для описания задачи и полученных гистограмм выберите пункт \'добавить/изменить описание\' на странице вашей задачи</p><p>P.S. Обдумайте всё как следует, и правильно всё опишите, перед тем как отправлять запрос, ведь вашу задачу будут видеть все. Ну и следите за грамотностью </p>'
    );
?>